Repository: 84000/data-translation-memory
Catalog: toh122-v1.tmx
Source language: bo
Languages: en

source: སངས་རྒྱས་དང་བྱང་ཆུབ་སེམས་དཔའ་ཐམས་ཅད་ལ་ཕྱག་འཚལ་ལོ། །
en: Homage to all buddhas and bodhisattvas!

source: འདི་སྐད་བདག་གིས་ཐོས་པ་དུས་གཅིག་ན།
en: Thus did I hear at one time.

source: བཅོམ་ལྡན་འདས་འོག་མིན་ལྷའི་རྒྱལ་པོའི་ཁང་བཟངས་ན་བཞུགས་ཏེ་
en: The Blessed One was residing in the palace of the king of the gods in the Akaniṣṭha realm,

source: འཁོར་ཐམས་ཅད་ལ་ཆོས་སྟོན་པ་དང་།
en: and was teaching the Dharma to the entire assembly there.

source: བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ནམ་མཁའི་སྙིང་པོས་བཅོམ་ལྡན་འདས་ལ་ཕྱག་འཚལ་ནས་འདི་སྐད་ཅེས་གསོལ་ཏོ། །
en: The bodhisattva mahāsattva Ākāśagarbha paid homage to the Blessed One and asked,

source: བཅོམ་ལྡན་འདས་བྱང་ཆུབ་སེམས་དཔའ་ནམ་འཆི་ཁ་མའི་སེམས་ཇི་ལྟར་བལྟ་བར་བགྱི།
en: “Blessed One, how is the mind to be viewed for a bodhisattva at the point of dying?”

source: བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ།
en: The Blessed One replied,

source: ནམ་མཁའི་སྙིང་པོ་བྱང་ཆུབ་སེམས་དཔའ་ནམ་འཆི་བའི་དུས་ཀྱི་ཚེ་འདའ་ཀ་ཡེ་ཤེས་བསྒོམ་པར་བྱའོ། །
en: “Ākāśagarbha, a bodhisattva, when the time comes to die, should cultivate wisdom at the hour of death.

source: དེ་ལ་འདའ་ཀ་ཡེ་ཤེས་ནི་
en: Wisdom at the hour of death is as follows:

source: ཆོས་ཐམས་ཅད་རང་བཞིན་གྱིས་རྣམ་པར་དག་པས་ན་དངོས་པོ་མེད་པའི་འདུ་ཤེས་རབ་ཏུ་བསྒོམ་པར་བྱའོ། །
en: “All phenomena are naturally pure. So, one should cultivate the clear understanding that there are no entities.

source: ཆོས་ཐམས་ཅད་བྱང་ཆུབ་ཀྱི་སེམས་སུ་འདུས་པས་ན་སྙིང་རྗེ་ཆེན་པོའི་འདུ་ཤེས་རབ་ཏུ་བསྒོམ་པར་བྱའོ། །
en: “All phenomena are subsumed within the mind of enlightenment. So, one should cultivate the clear understanding of great compassion.

source: ཆོས་ཐམས་ཅད་རང་བཞིན་གྱིས་འོད་གསལ་བས་ན་མི་དམིགས་པའི་འདུ་ཤེས་རབ་ཏུ་བསྒོམ་པར་བྱའོ། །
en: “All phenomena are naturally luminous. So, one should cultivate the clear understanding of nonapprehension.

source: དངོས་པོ་ཐམས་ཅད་མི་རྟག་པས་ན་ཅི་ལ་ཡང་མི་ཆགས་པའི་འདུ་ཤེས་རབ་ཏུ་བསྒོམ་པར་བྱའོ། །
en: “All entities are impermanent. So, one should cultivate the clear understanding of nonattachment to anything whatsoever.

source: སེམས་རྟོགས་ན་ཡེ་ཤེས་ཡིན་པས་ན་སངས་རྒྱས་གཞན་དུ་མི་བཙལ་བའི་འདུ་ཤེས་རབ་ཏུ་བསྒོམ་པར་བྱའོ། །
en: “When one realizes mind, this is wisdom. So, one should cultivate the clear understanding of not seeking the Buddha elsewhere.”

source: བཅོམ་ལྡན་འདས་ཀྱིས་ཚིགས་སུ་བཅད་དེ་བཀའ་སྩལ་པ།
en: The Blessed One then spoke the following verses:

source: ཆོས་རྣམས་རང་བཞིན་རྣམ་དག་པས། །
en: “Since all phenomena are naturally pure,

source: དངོས་པོ་མེད་པའི་འདུ་ཤེས་བསྒོམ། །
en: One should cultivate the clear understanding that there are no entities.

source: བྱང་ཆུབ་སེམས་དང་རབ་ལྡན་པས།
en: “Since all phenomena are connected with the enlightened mind,

source: སྙིང་རྗེ་ཆེན་པོའི་འདུ་ཤེས་བསྒོམ། །
en: One should cultivate the clear understanding of great compassion.

source: ཆོས་རྣམས་རང་བཞིན་འོད་གསལ་བས། །
en: “Since all phenomena are naturally luminous,

source: དམིགས་པ་མེད་པའི་འདུ་ཤེས་བསྒོམ། །
en: One should cultivate the clear understanding of nonapprehension.

source: དངོས་པོ་ཐམས་ཅད་མི་རྟག་པས། །
en: “Since all entities are impermanent,

source: ཆགས་པ་མེད་པའི་འདུ་ཤེས་བསྒོམ། །
en: One should cultivate the clear understanding of nonattachment.

source: སེམས་ནི་ཡེ་ཤེས་འབྱུང་བའི་རྒྱུ། །
en: “Since the mind is the cause for the arising of wisdom,

source: སངས་རྒྱས་གཞན་དུ་མ་ཚོལ་ཅིག
en: Do not look for the Buddha elsewhere.”

source: བཅོམ་ལྡན་འདས་ཀྱིས་དེ་སྐད་ཅེས་བཀའ་སྩལ་པ་དང་།
en: After the Blessed One had spoken,

source: བྱང་ཆུབ་སེམས་དཔའ་ནམ་མཁའི་སྙིང་པོ་ལ་སོགས་པའི་འཁོར་འདུས་པ་ཐམས་ཅད་རབ་ཏུ་དགའ་མགུ་ཡི་རངས་ནས།
en: the whole assembly, including the bodhisattva Ākāśagarbha and others, were overjoyed and

source: བཅོམ་ལྡན་འདས་ཀྱིས་གསུངས་པ་ལ་མངོན་པར་བསྟོད་དོ།། །།
en: full of praise for the Buddha’s words.

source: འཕགས་པ་འདའ་ཀ་ཡེ་ཤེས་ཞེས་བྱ་བ་ཐེག་པ་ཆེན་པོའི་མདོ་རྫོགས་སོ།།
en: This concludes The Noble Mahāyāna Sūtra “Wisdom at the Hour of Death.”
